parse source . . name .
pathlen = length(name)
say substr(name, pathlen - 13, 4) substr(name, pathlen - 9, 4)

/* Based on the being named Code_Golf.nrx
parse source . . name .
pathlen = length(name)
say substr(name, pathlen - 12, 4) substr(name, pathlen - 7, 4)
*/
